#### Name: Marwa Samy
#### Project:Explore SanFrancisco_EmployeeSalary

[Download Dataset](https://www.kaggle.com/kaggle/sf-salaries)

In [102]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [103]:
data = pd.read_csv('Salaries.csv')
data.head(3)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN

In [104]:
data.tail(2)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

### Find Shape of Our Dataset (Number of Rows And Number of Columns)

In [105]:
data.shape

(148654, 13)

In [106]:
print('num of rows',data.shape[0])
print('num of columns',data.shape[1])

num of rows 148654
num of columns 13

In [107]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

### Check Null Values In The Dataset

In [108]:
data.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

###  Drop ID, Notes, Agency and Status and Benefits Columns

In [109]:
data=data.drop(['Id','Benefits','Notes','Status'],axis=1)

In [110]:
data.head(1)

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,TotalPay,TotalPayBenefits,Year,Agency
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,567595.43,567595.43,2011,San Francisco

### Get Overall Statistics About The Dataframe

In [111]:
data.describe()

,BasePay,OvertimePay,OtherPay,TotalPay,TotalPayBenefits,Year
count,148045.000000,148650.000000,148650.000000,148654.000000,148654.000000,148654.000000
mean,66325.448841,5066.059886,3648.767297,74768.321972,93692.554811,2012.522643
std,42764.635495,11454.380559,8056.601866,50517.005274,62793.533483,1.117538
min,-166.010000,-0.010000,-7058.590000,-618.130000,-618.130000,2011.000000
25%,33588.200000,0.000000,0.000000,36168.995000,44065.650000,2012.000000
50%,65007.450000,0.000000,811.270000,71426.610000,92404.090000,2013.000000
75%,94691.050000,4658.175000,4236.065000,105839.135000,132876.450000,2014.000000
max,319275.010000,245131.880000,400184.250000,567595.430000,567595.430000,2014.000000

In [112]:
data.describe(include='all')

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,TotalPay,TotalPayBenefits,Year,Agency
count,148654,148654,148045.000000,148650.000000,148650.000000,148654.000000,148654.000000,148654.000000,148654
unique,110811,2159,NaN,NaN,NaN,NaN,NaN,NaN,1
top,Kevin Lee,Transit Operator,NaN,NaN,NaN,NaN,NaN,NaN,San Francisco
freq,13,7036,NaN,NaN,NaN,NaN,NaN,NaN,148654
mean,NaN,NaN,66325.448841,5066.059886,3648.767297,74768.321972,93692.554811,2012.522643,NaN
std,NaN,NaN,42764.635495,11454.380559,8056.601866,50517.005274,62793.533483,1.117538,NaN
min,NaN,NaN,-166.010000,-0.010000,-7058.590000,-618.130000,-618.130000,2011.000000,NaN
25%,NaN,NaN,33588.200000,0.000000,0.000000,36168.995000,44065.650000,2012.000000,NaN
50%,NaN,NaN,65007.450000,0.000000,811.270000,71426.610000,92404.090000,2013.000000,NaN
75%,NaN,NaN,94691.050000,4658.175000,4236.065000,105839.135000,132876.450000,2014.000000,NaN
max,NaN,NaN,319275.010000,245131.880000,400184.250000,567595.430000,567595.430000,2014.000000,NaN

### Find Occurrence of The Employee Names  (Top 5)

In [113]:
data['EmployeeName'].value_counts().head()

Kevin Lee       13
Steven Lee      11
Richard Lee     11
William Wong    11
John Chan        9
Name: EmployeeName, dtype: int64

###  Find The Number of Unique Job Titles

In [115]:
data['JobTitle'].nunique()

2159

### Total Number of Job Titles Contain Captain

In [116]:
len(data[data['JobTitle'].str.contains('Captain',case=False)])

552

###  Display All the Employee Names From Fire Department

In [117]:
data[data['JobTitle'].str.contains('fire',case=False)]['EmployeeName']

4            PATRICK GARDNER
6                  ALSON LEE
8             MICHAEL MORRIS
9         JOANNE HAYES-WHITE
10             ARTHUR KENNEY
                 ...
145956      Kenneth C Farris
147556         Edward A Dunn
148021        Kari A Johnson
148209          Sheryl K Lee
148554       Lawrence F Gatt
Name: EmployeeName, Length: 5879, dtype: object

### Find Minimum, Maximum and Average BasePay

In [118]:
data['BasePay'].describe()

count    148045.000000
mean      66325.448841
std       42764.635495
min        -166.010000
25%       33588.200000
50%       65007.450000
75%       94691.050000
max      319275.010000
Name: BasePay, dtype: float64

### Replace 'Not Provided' in EmployeeName' Column to NaN

In [119]:
data['EmployeeName']=data['EmployeeName'].replace('Not provided',np.nan)

In [120]:
data['EmployeeName']

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650                  NaN
148651                  NaN
148652                  NaN
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

###  Drop The Rows Having 5 Missing Values

In [121]:
data[data.isnull().sum(axis=1)==5]

Empty DataFrame
Columns: [EmployeeName, JobTitle, BasePay, OvertimePay, OtherPay, TotalPay, TotalPayBenefits, Year, Agency]
Index: []

In [122]:
data.drop(data[data.isnull().sum(axis=1)==5].index,axis=0,inplace=True)

In [123]:
len(data[data.isnull().sum(axis=1)==5])

0

###  Find Job Title of ALBERT PARDINI

In [124]:
data[data['EmployeeName']=='ALBERT PARDINI']['JobTitle']

2    CAPTAIN III (POLICE DEPARTMENT)
Name: JobTitle, dtype: object

###  How Much ALBERT PARDINI Make (Include Benefits) ?

In [126]:
data[data['EmployeeName']=='ALBERT PARDINI']['TotalPayBenefits']

2    335279.91
Name: TotalPayBenefits, dtype: float64

### Display Name of The Person Having The Highest BasePay

In [127]:
data[data['BasePay'].max()==data['BasePay']]['EmployeeName']

72925    Gregory P Suhr
Name: EmployeeName, dtype: object

### Find Average BasePay of All Employee Per Year

In [128]:
data.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

### Find Average BasePay of All Employee Per JobTitle

In [129]:
data.groupby('JobTitle').mean()['BasePay']

JobTitle
ACCOUNT CLERK                                     43300.806506
ACCOUNTANT                                        46643.172000
ACCOUNTANT INTERN                                 28732.663958
ACPO,JuvP, Juv Prob (SFERS)                       62290.780000
ACUPUNCTURIST                                     66374.400000
                                                      ...
X-RAY LABORATORY AIDE                             47664.773077
X-Ray Laboratory Aide                             46086.387100
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS    52609.910000
Youth Comm Advisor                                39077.957500
ZOO CURATOR                                       43148.000000
Name: BasePay, Length: 2159, dtype: float64

###  Find Average BasePay of Employee Having Job Title ACCOUNTANT

In [130]:
data.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'TotalPay', 'TotalPayBenefits', 'Year', 'Agency'],
      dtype='object')

In [131]:
data[data['JobTitle']=='ACCOUNTANT']['BasePay'].mean()

46643.172

### Find Top 5 Most Common Jobs

In [132]:
data['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64